===
simple local
===

locals {
  ami = "a-123"
  age = 76
}

---

(configuration
  (locals
    (block
      (attribute (identifier) (string_literal))
      (attribute (identifier) (number)))))

===
ternary operation with equality
===

locals {
  foo = var.bla == "production" ? "bla" : "thing"
}
---

(configuration
  (locals
    (block
      (attribute (identifier) (ternary (comparison (reference) (eq) (string_literal)) (string_literal) (string_literal) )))))

===
ternary operation with greater than
===

locals {
  foo = var.bla > 10 ? "bla" : "thing"
}
---

(configuration
  (locals
    (block
      (attribute (identifier) (ternary (comparison (reference) (gt) (number)) (string_literal) (string_literal) )))))

===
ternary operation with less than
===

locals {
  foo = var.bla < 10 ? "bla" : "thing"
}
---

(configuration
  (locals
    (block
      (attribute (identifier) (ternary (comparison (reference) (lt) (number)) (string_literal) (string_literal) )))))
